var obj = {
    filed1: [],
    filed2: 'string',
    filed3: false
};

var arrC = new Object();

// accоциативный массив, хеш-таблица

/*
    Хеш-таблица — это структура данных, реализующая интерфейс ассоциативного массива, а именн
    о, она позволяет хранить пары (ключ, значение) и выполнять три операции:
    операцию добавления новой пары, операцию поиска и операцию удаления пары по ключу.
*/

// поля/свойства и методы объекты

// обращение к полям объекта разница между [] и .

// оператор in

/*
    в JavaScript можно обратиться к любому свойству объекта, даже если его нет.
    добавление свойств. Существование свойства может проверять оператор
    in: if ("prop" in obj), как правило, работает и просто сравнение if (obj.prop !== undefined).
*/

// удаление свойств delete obj.name

// обход полей объекта
